### 📋 Terraform Plan Result for DEV Environment 
  
  **Working Directory:** `environments/dev`
  **Variables File:** `devterraform.tfvars`
  **Branch:** `feature-terraform`
  
  <details>
  <summary>Click to expand Terraform Plan</summary>
  
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev_acr.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "acrdemodev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-demo-dev-0"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.dev_acr.azurerm_key_vault_access_policy.microservice_keyvault_access will be created
  + resource "azurerm_key_vault_access_policy" "microservice_keyvault_access" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # module.dev_acr.azurerm_role_assignment.aks_acr_pull will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.dev_acr.azurerm_role_assignment.aks_acr_push will be created
  + resource "azurerm_role_assignment" "aks_acr_push" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f7d85d1d-58ae-40ca-b789-922c676a27fb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.dev_acr.azurerm_role_assignment.microservice_acr_pull will be created
  + resource "azurerm_role_assignment" "microservice_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.dev_acr.azurerm_user_assigned_identity.microservice_identity will be created
  + resource "azurerm_user_assigned_identity" "microservice_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "identity-microservices-demo-dev"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-demo-dev-0"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.dev_aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-demo-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "eastus"
      + name                                = "aks-demo-dev"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-demo-dev-0"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = (known after apply)
      + workload_identity_enabled           = true

      + default_node_pool {
          + enable_auto_scaling         = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 2
          + max_pods                    = 50
          + min_count                   = 1
          + name                        = "system"
          + node_count                  = (known after apply)
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = (known after apply)
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "sytemp001"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_B2s"
          + vnet_subnet_id              = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Network/virtualNetworks/vnet-demo-dev/subnets/snet-aks-demo-dev"
          + workload_runtime            = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-demo-dev",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + network_profile {
          + dns_service_ip          = "10.2.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "basic"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = (known after apply)
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.2.0.0/24"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }
    }

  # module.dev_aks.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "log-demo-dev"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-demo-dev-0"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.dev_aks.azurerm_user_assigned_identity.aks_identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "aks_identity" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-demo-dev"
        name                = "identity-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.dev_keyvault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_keyvault.data.http.current_ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "current_ip" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://ipv4.icanhazip.com"
    }

  # module.dev_keyvault.azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "kv-aks-demo-dev-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-demo-dev-0"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = (known after apply)
      + tenant_id                     = (known after apply)
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.dev_keyvault.azurerm_key_vault_access_policy.current_user will be created
  + resource "azurerm_key_vault_access_policy" "current_user" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Purge",
          + "Recover",
        ]
      + tenant_id          = (known after apply)
    }

  # module.dev_keyvaultidentity.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_keyvaultidentity.azurerm_federated_identity_credential.workload_identity will be created
  + resource "azurerm_federated_identity_credential" "workload_identity" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "keyvault-workload-identity"
      + parent_id           = (known after apply)
      + resource_group_name = "rg-demo-dev-0"
      + subject             = "system:serviceaccount:default:workload-identity-sa"
    }

  # module.dev_keyvaultidentity.azurerm_role_assignment.keyvault_secrets_user will be created
  + resource "azurerm_role_assignment" "keyvault_secrets_user" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.dev_keyvaultidentity.azurerm_user_assigned_identity.workload_identity will be created
  + resource "azurerm_user_assigned_identity" "workload_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "identity-keyvault-demo-dev"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-demo-dev-0"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.dev_networking.azurerm_network_security_group.aks_nsg will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Network/networkSecurityGroups/nsg-demo-dev"
        name                = "nsg-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.dev_networking.azurerm_virtual_network.vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet" {
        id                      = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Network/virtualNetworks/vnet-demo-dev"
        name                    = "vnet-demo-dev"
      ~ tags                    = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.dev_resourcegroup.azurerm_resource_group.resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "resourcegroup" {
        id       = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0"
        name     = "rg-demo-dev-0"
      ~ tags     = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dev_storageaccount.azurerm_storage_account.storage_account[0] will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Storage/storageAccounts/stdemodev9e8p5ljy"
        name                              = "stdemodev9e8p5ljy"
      ~ tags                              = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (42 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 13 to add, 5 to change, 0 to destroy.

  ```
  
  </details>
  
  *Pusher: @jafarsadiquebarbhuiya, Action: `pull_request`*